# Заявляется, что партия изготавливается со средним арифметическим 2,5 см. 
# Проверить данную гипотезу, если известно, что размеры изделий подчинены 
# нормальному закону распределения. Объем выборки 10,
# уровень статистической значимости 5%
# 2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34

import scipy.stats as stats

# Заданные значения
sample_data = [2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34]  # Значения в выборке
null_mean = 2.5  # Заданное нулевое предполагаемое среднее значение
n = len(sample_data)  # Объем выборки
alpha = 0.05  # Уровень значимости

# Одновыборочный t-тест
t_statistic, p_value = stats.ttest_1samp(sample_data, null_mean)

# Определение статистической значимости
if p_value < alpha:
    print("Отвергаем нулевую гипотезу. Среднее значение выборки значимо отличается от заданного значения.")
else:
    print("Не можем отвергнуть нулевую гипотезу. Среднее значение выборки не значимо отличается от заданного значения.")

